const Questions = {
  1:{
    question:`ვფიქრობ, ადრინდელთან შედარებით ჩემი მეხსიერება ამჟამად უკეთესია.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  2:{
    question:`სიამოვნებით ვიცხოვრებდი მარტო, ადამიანებისაგან მოშორებით.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  3:{
    question:`თუ ვიტყვი, რომ ”ცა ძირსაა” და ”ზამთარში ცხელა”, მაშინ ბოროტმოქმედს უნდა ვუწოდო:`,
    a:'განგსტერი',
    b:'წმინდანი',
    c:'საეჭვო'
  },
  4:{
    question:`ღამით მე:`,
    a:'ადვილად ვიძინებ',
    b:'მიძნელდება პასუხი',
    c:'მიჭირს დაძინება'
  },
  5:{
    question:`მანქანებით გადატვირთულ ტრასაზე მოძრაობის დროს:`,
    a:'სხვას მივცემდი შე­საძ­ლებ­ლობას გაესწრო ჩემთვის',
    b:'მიჭირს თქმა',
    c:'შევეცდებოდი ყველასათვის გამესწრო'
  },
  6:{
    question:`წვეულებებზე სხვებს ვაძლევ ხუმრობისა და აქტიურობის საშუალებას.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  7:{
    question:`კარგად ვგრძნობ თავს მხოლოდ მაშინ, როცა ჩემს ირგვლივ ყველაფერი წესრიგშია.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  8:{
    question:`წვეულებაზე ნაცნობთა უმრავლესობას ნამდვილად უხარიათ ჩემი დანახვა.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  9:{
    question:`თავისუფალ დროს სიამოვნებით შევავსევდი:`,
    a:'ფარიკაობით ან ცეკვით',
    b:'მიჭირს თქმა',
    c:'ჭიდაობით ან კალათბურთის თამაშით'
  },
  10:{
    question:`ხშირად ვამჩნევ განსვლას ადამიანის ქცევასა და მის ნათქვამს შორის.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  11:{
    question:`რაიმე მოვლენის შესახებ ინფორმაციას რომ ვეცნობი, მაინტერესებს ყველა წვრილმანი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  12:{
    question:`მეგობრები თუ მამასხარავებენ ან ხუმრობით მაშაყირებენ, ჩვეულებრივ, მათთან ერთად ვიცინი და სულაც არ ვბრაზობ.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  13:{
    question:`თუ ვინმემ უკმეხად მომმართა, შემიძლია ეს ადვილად დავივიწყო.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  14:{
    question:`საქმის კეთებისას ვამჯობინებ მოვიგონო ახალ-ახალი ხერხები, ვიდრე გამო­ვი­ყე­ნო უკვე ნაცადი გზა.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  15:{
    question:`რაიმეს რომ ვგეგმავ, მირჩევნია ვიმოქმედო დამოუკიდებლად, სხვისი დახ­მა­რე­ბის გარეშე.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  16:{
    question:`ვთვლი, რომ სხვებთან შედარებით ნაკლებ მგრძნობიარე და იმპულსური ვარ.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  17:{
    question:`მაღიზიანებს ადამიანები, რომლებსაც უჭირთ გადაწყვეტილების სწრაფად მიღება.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  18:{
    question:`ზოგჯერ გამჩენია (მიჩნდება) პროტესტის გრძნობა მშობლების მიმართ.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  19:{
    question:`ჩემს ფარულ ინტიმურ აზრებს და სურვილებს:`,
    a:'გავანდობდი ახლო მეგობრებს',
    b:'მიჭირს თქმა',
    c:'ვერავის გავანდობდი'
  },
  20:{
    question:`ვფიქრობ, სიტყვა ”დაუდევარის” საპირისპიროა:`,
    a:'პედანტური',
    b:'აკურატული',
    c:'მოწესრიგებული'
  },
  21:{
    question:`საჭიროების შემთხვევაში ყოველთვის მაქვს საკმარისი ენერგია.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  22:{
    question:`უფრო მაღიზიანებს ისეთი ადამიანები, რომლებიც:`,
    a:'თავიანთი უხეში ხუმრობით უხერხულ მდგომარეობაში აგდებენ სხვებს',
    b:'მიჭირს თქმა',
    c:'მიქმნიან სიძ­ნე­ლე­ებს იმით, რომ იგვიანებენ ჩემთან დათქმულ შეხვედრაზე'
  },
  23:{
    question:`ძალიან მიყვარს სტუმრების დაპატიჟება და მათთან ერთად გართობა.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  24:{
    question:`ვფიქრობ, რომ:`,
    a:'ყველა სამუშაო არ მოითხოვს ერთნაირ გულმოდგინებას',
    b:'მიჭირს თქმა',
    c:'ნებისმიერი სამუშაო უნდა შესრულდეს გულდასმით, თუ ადა­მია­ნი მოჰკიდებს მას ხელს'
  },
  25:{
    question:`ყოველთვის მიხდება უხერხულობისა და შებოჭილობის განცდის დაძლევა.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  26:{
    question:`მეგობრები უფრო ხშირად:`,
    a:'მე მთხოვენ რჩევა-დარიგებას',
    b:'მიჭირს თქმა',
    c:'ჭკუას მარიგებენ'
  },
  27:{
    question:`როცა ჩემი ახლობელი ცდილობს რაიმეში გამაცუროს, ვამჯობინებ ეს არ შე­ვიმ­ჩნიო, ვიდრე ვამხილო.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  28:{
    question:`მომწონს მეგობრები, რომლებსაც:`,
    a:'ქვთ საქმიანი და პრაქტიკული ინტერესები',
    b:'მიჭირს თქმა',
    c:'გააჩნიათ ღრმად გააზრებული შეხედულებები ცხოვრებაზე'
  },
  29:{
    question:`ვერ ვიღებ სხვების მხრიდან ჩემი შეხედულებების საწინააღმდეგოდ გამოთქმულ აზრებს.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  30:{
    question:`ჩემს მიერ წარსულში დაშვებული შეცდომები მაწუხებს.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  31:{
    question:`თანაბრად კარგი მონაცემები რომ მქონდეს სპორტის ორივე სახეობის მიმართ, ვამჯობინებდი:`,
    a:'ჭადრაკს',
    b:'მიჭირს თქმა',
    c:'მშვილდოსნობას'
  },
  32:{
    question:`მომწონს კონტაქტური და დამყოლი ადამიანები.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  33:{
    question:`იმდენად ფრთხილი და პრაქტიკული ვარ, რომ ნაკლებად ვაწყდები უსიამოვნო მოულოდნელობას, ვიდრე სხვა ადამიანები.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  34:{
    question:`აუცილებლობის შემთხვევაში შემიძლია დავივიწყო ჩემი საზრუნავი და მოვალეობები.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  35:{
    question:`მიძნელდება იმის აღიარება, რომ მართალი არ ვარ.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  36:{
    question:`საწარმოში მეტი ხალისით ვიმუშავებდი:`,
    a:'კომპიუტერის ოპერატორად',
    b:'მიჭირს თქმა',
    c:'მენეჯერად'
  },
  37:{
    question:`რომელი სიტყვა არ არის დაკავშირებული დანარჩენ ორთან:`,
    a:'კატა',
    b:'ახლოს',
    c:'მზე'
  },
  38:{
    question:`ის, რაც ხელს მიშლის ყურადღების კონცენტრაციაში:`,
    a:'მაღიზიანებს',
    b:'მიჭირს თქმა',
    c:'სულაც არ მაწუხებს'
  },
  39:{
    question:`მომწონს, როცა მემსახურებიან:`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  40:{
    question:`ჩემთვის ყველაზე დიდი სასჯელია:`,
    a:'მძიმე სამუშაო',
    b:'მიჭირს თქმა',
    c:'სხვებისგან იზოლირებულად, მარტოდ ყოფნა'
  },
  41:{
    question:`ჩემი აზრით, ადამიანებმა უფრო მკაცრად უნდა დაიცვან ზნეობრივი წესები, ვიდრე ამას აკეთებენ. `,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  42:{
    question:`ჩემთვის უთქვამთ, რომ ბავშვობაში ვიყავი:`,
    a:'მშვიდი და მიყვარდა მარტო დარ­ჩენა',
    b:'მიჭირს თქმა',
    c:'ცოცხალი და მოუსვენარი'
  },
  43:{
    question:`ვფიქრობ, მომეწონებოდა კომპიუტერთან ან სხვადასხვა ტექნიკურ საშუა­ლე­ბას­თან ყოველდღიური პრაქტიკული მუშაობა.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  44:{
    question:`ვფიქრობ, მოწმეების უმრავლესობა სიმართლეს ამბობს, მაშინაც კი, როცა ეს მათ­თვის ადვილი არ არის. `,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  45:{
    question:`ზოგჯერ უარს ვამბობ ცხოვრებაში ჩემი იდეების გატარებაზე, რადგანაც მგონია, რომ მათი განხორციელება შეუძლებელია. `,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  46:{
    question:`სხვებისგან განსვავებით, ვცდილობ ხუმრობაზე ხმამაღლა არ გავიცინო.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  48:{
    question:`მუსიკალური ნაწარმოებიდან მეტ სიამოვნებას მანიჭებს:`,
    a:'სასულე ორკესტრის მიერ შესრულებული მარში',
    b:'მიჭირს თქმა',
    c:'ვიოლინოს სოლო კონცერტი'
  },
  49:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  47:{
    question:`არასდროს არ ვგრძნობ თავს იმდენად უბედურად, რომ მომინდეს ტირილი.`,
    a:'დიახ',
    b:'მიჭირს თქმა',
    c:'არა'
  },
  
}

export default Questions;