export interface IQuestion{
  number: number;
  ა: string;
  ბ: string;
}

export const questions: Array<IQuestion> = [
  {
    number: 1,
    'ა': 'ბავშვები ხშირად ხიფათში ეხვევიან იმის გამო, რომ მშობლები მათ მეტისმეტად მკაცრად ექცევიან;',
    'ბ': 'უსიამოვნებათა მიზეზი, რაც ბავშვებს შეიძლება შეემთხვეს, ჩვენს დროში არის ის, რომ მშობლები მათ ზედმეტად რბილად ეპყრობიან.'
  },
  {
    number: 2,
    'ა': 'უსიამოვნებების მიზეზი ადამიანის ცხოვრებაში გარკვეულწილად მის უიღბლობას უკავშირდება;',
    'ბ': 'უსიამოვნება, რომელიც ადამიანს ცხოვრებაში ხვდება, მისივე შეცდომების შედეგია.'
  },
  {
    number: 3,
    'ა': 'ომების ერთ-ერთი ძირითადი მიზეზი ისაა, რომ ადამიანები პოლიტიკისადმი საკმარის ინტერესს არ იჩენენ;',
    'ბ': 'ომები ყოველთვის იქნება, რაც არ უნდა ეცადო მათი თავიდან აცილება.'
  },
  {
    number: 4,
    'ა': `საბოლოო ჯამში, ადამიანი დამსახურებულ აღიარებას ჰპოვებს;`,
    'ბ': `სამწუხაროდ, მთელი მისი მცდელობის მიუხედავად, ადამიანის ღვაწლი ხშირად აღია­რე­ბის გარეშე რჩება.`
  },
  {
    number: 5,
    'ა': 'არ არის სწორი აზრი, თითქოს პედაგოგები სტუდენტების მიმართ უსამართლო არიან; ',
    'ბ': 'სტუდენტების უმრავლესობა ვერ აცნობიერებს, თუ რაოდენ დიდ გავლენას ახდენს მათ შეფასებაზე შემთხვევითობა. '
  },
  {
    number: 6,
    'ა': ' ხელშემწყობი გარემოებათა გარეშე შეუძლებელია გახდე წარმატებული ხელმძღვანელი; ',
    'ბ': ' უნარიანი ადამიანი იმიტომ ვერ ხდება კარგი ხელმძღვანლი, რომ ვერ იყენებეს თავის შესაძლებლობებს; '
  },
  {
    number: 7,
    'ა': ' რაც არ უნდა ეცადო, ყველას მოსაწონი ვერ იქნები; ',
    'ბ': ' ადამიანები სხვების მოწონებას იმიტომ ვერ იმსახურებენ, რომ არ იციან, როგორ მოიქცნენ მათთან. '
  },
  {
    number: 8,
    'ა': ' პიროვნების ინდივიდუალობის ჩამოყალიბებაში ძირითად როლს მემკვიდრეობა თა­მა­შობს; ',
    'ბ': ' ინდივიდუალობას განაპირობებს ცხოვრებისეული გამოცდილება. '
  },
  {
    number: 9,
    'ა': ' ხშირად დავრწმუნებულვარ, რომ ის, რაც მოსახდენია, მოხდება; ',
    'ბ': ' ბედის იმედზე ყოფნა ხელს არ მოგვცემს, უმჯობესია თვითონ გადაწყვიტო, რა იღონო.'
  },
  {
    number: 10,

    'ა': ' მომზადებული სტუდენტისათვის არ არსებობს უსამართლო გამოცდა; ',
    'ბ': ' ხშირად სწავლა აზრს კარგავს იმიტომ, რომ გამოცდაზე ნიშნის მიღება მასწავლებლის ნება - სურვილზეა დამოკიდებული.'
  },
  {
    number: 11,
    'ა': ' წარმატება სერიოზული შრომით მიიღწევა, იღბალი და გამართლება არაფერ შუაშია; ',
    'ბ': ' წარმატების მიღწევა მხოლოდ მაშინ არის შესაძლებელი, თუ ვინმე გავლენიანი დამ­ხმა­რე გყავს. '
  },
  {
    number: 12,
    'ა': ' რიგით მოქალაქეს შეუძლია მოახდინოს გავლენა ხელისუფალთა გადაწყვეტილებებზე; ',
    'ბ': ' ამ სამყაროს მართავს ძალაუფლების მქონე ადამიანთა მცირე ჯგუფი, რიგითი ადამიანი ბევრს ვერაფერს გახდება. '
  },
  {
    number: 13,
    'ა': ' როცა რაიმეს ვგეგმავ, მის განხორციელებაში დარწმუნებული ვარ; ',
    'ბ': ' ზოგჯერ უაზრობაა რაიმეს დაგეგმვა, რადგანაც ბევრი რამ ბედზეა დამოკიდებული.'
  },
  {
    number: 14,
    'ა': ' ზოგიერთი ადამიანი არანაირ ღირებულებას არ წარმოადგენს; ',
    'ბ': ' ყველა ადამიანში არის რაღაც კარგი. '
  },
  {
    number: 15,
    'ა': ' ჩემთვის იმის მიღწევას, რაც მსურს, არაფერი აქვს საერთო იღბალთან; ',
    'ბ': ' ზოგჯერ არანაირი აზრი არ აქვს იმას, თუ რა გადაწყვეტილებას მივიღებთ, რას მოვიმოქმედებთ.'
  },
  {
    number: 16,
    'ა': ' სამსახურეობრივი წინსვლა ხშირად დამოკიდებულია შემთხვევითობაზე და სხვების ნება - სურვილზე; ',
    'ბ': ' სამსახურეობრივი კარიერა ადამიანის მონდომებასა და უნარებზეა დამოკიდებული, იღბალი აქ არაფერ შუაშია.'
  },
  {
    number: 17,
    'ა': ' ადამიანთა უმრავლესობა მსოფლიო მოვლენების მსხვერპლია, რომელთა გაგება და კონტროლი მათ არ ძალუძთ; ',
    'ბ': ' პოლიტიკურ და სოციალურ პროცესებში აქტიური მონაწილეობით ადამიანებს შეუძლიათ მსოფლიო მოვლენათა კონტროლი.'
  },
  {
    number: 18,
    'ა': ' ადამიანთა უმრავლესობა ვერ აცნობიერებს, თუ რამდენად განსაზღვრავს მათ ცხოვ­რე­ბას შემთხვევითობა; ',
    'ბ': ' ფაქტიურად “იღბალი”, როგორც ასეთი, არ არსებობს.'
  },
  {
    number: 19,
    'ა': ' ყოველთვის უნდა იყო მზად აღიარო საკუთარი შეცდომები; ',
    'ბ': ' ჩვეულებრივ, უმჯობესია დაფარო საკუთარი შეცდომები.'
  },
  {
    number: 20,
    'ა': ' ძნელია იმის გაგება, ნამდვილად მოსწონხარ თუ არა ადამიანს; ',
    'ბ': ' მეგობრების რაოდენობა დამოკიდებულია იმაზე, თუ რამდენად სასიამოვნო პიროვნება ხარ. '
  },
  {
    number: 21,
    'ა': ' დრო ყველაფრის მკურნალია – ჩვეულებრივ, წარუმატებლობას წარმატება სცვლის; ',
    'ბ': ' წარუმატებლობა, ფაქტობრივად, უუნარობის, უცოდინარობის, სიზარმაცის(ან სამივეს ერთად\': \' შედეგია. '},
  {
    number: 22,
    'ა': ' თუ მოვინდომებთ, პროტექციონიზმის აღმოფხვრას შევძლებთ; ',
    'ბ': ' რიგითი ადამიანი ვერაფერს შეცვლის ხელმძღვანელი მუშაკის სამოქმედო პოლიტიკაში.'
  },
  {
    number: 23,
    'ა': ' ზოგჯერ ვერ გაიგებ, რა პრინციპით წერენ მასწავლებლები ნიშნებს; ',
    'ბ': ' ნიშნებს ცოდნა განსაზღვრავს.'
  },
  {
    number: 24,
    'ა': ' კარგი ხელმძღვანელი კოლექტივს ინიციატივის გამოჩენის შესაძლებლობას აძლევს; ',
    'ბ': ' კარგი ხელმძღვანელი თვითონ წარმართავს კოლექტივის ინიციატივას.'
  },
  {
    number: 25,
    'ა': ' ხშირად მეჩვენება, რომ ნაკლებად ვახდენ ზეგავლენას იმაზე, რაც მემართება; ',
    'ბ': ' ვერ დავიჯერებ, რომ შემთხვევა ან იღბალი განსაზღვრავს ჩემს ცხოვრებას.'
  },
  {
    number: 26,
    'ა': ' ადამიანები მარტო რჩებიან, რადგან არ ცდილობენ იყვნენ მეგობრული; ',
    'ბ': ' ნუ გაირჯები თავი მოაწონო ადამიანებს, მაინც არაფერი გამოგივა. '
  },
  {
    number: 27,
    'ა': ' უმაღლეს სასწავლებლებში ზედმეტ ყურადღებას აქცევენ სპორტს; ',
    'ბ': ' “გუნდური სპორტი” ხასიათის ჩამოყალიბების საუკეთესო საშუალებაა.'
  },
  {
    number: 28,
    'ა': ' რაც მემართება, ჩემით მემართება; ',
    'ბ': ' ზოგჯერ ვგრძნობ, რომ ჩემს ცხოვრებას ვერ წარვმართავ.'
  },
  {
    number: 29,
    'ა': ' ხშირად ძნელია გაიგო, თუ რატომ იქცევიან ხელმძღვანლები ასე და არა სხვაგვარად; ',
    'ბ': ' საბოლოო ჯამში ადამიანები პასუხს აგებენ ყველა რანგის ხელმძღვანელთა ავკარგიანობაზე.'
  },
];

export const answers = {
  2: 'ა',
  3: `ბ`,
  4: `ბ`,
  5: `ბ`,
  6: `ა`,
  7: `ა`,
  9: `ა`,
  10: `ბ`,
  11: `ბ`,
  12: `ბ`,
  13: `ბ`,
  15: `ბ`,
  16: `ა`,
  17: `ა`,
  18: `ა`,
  20: `ა`,
  21: `ა`,
  22: `ბ`,
  23: `ა`,
  25: `ა`,
  26: `ბ`,
  28: 'ბ',
  29: 'ა',
}