import React, { useState, useEffect, createRef } from 'react';
import ArrayShuffler from '../Utils/ArrayShuffler';
import RoterImage from './../Images/roter.jpg';


const questions: Array<any> = [
  {
    number: 1,
    'ა': 'ბავშვები ხშირად ხიფათში ეხვევიან იმის გამო, რომ მშობლები მათ მეტისმეტად მკაცრად ექცევიან;',
    'ბ': 'უსიამოვნებათა მიზეზი, რაც ბავშვებს შეიძლება შეემთხვეს, ჩვენს დროში არის ის, რომ მშობლები მათ ზედმეტად რბილად ეპყრობიან.'
  },
  {
    number: 2,
    'ა': 'უსიამოვნებების მიზეზი ადამიანის ცხოვრებაში გარკვეულწილად მის უიღბლობას უკავშირდება;',
    'ბ': 'უსიამოვნება, რომელიც ადამიანს ცხოვრებაში ხვდება, მისივე შეცდომების შედეგია.'
  },
  {
    number: 3,
    'ა': 'ომების ერთ-ერთი ძირითადი მიზეზი ისაა, რომ ადამიანები პოლიტიკისადმი საკმარის ინტერესს არ იჩენენ;',
    'ბ': 'ომები ყოველთვის იქნება, რაც არ უნდა ეცადო მათი თავიდან აცილება.'
  },
  {
    number: 4,
    'ა': `საბოლოო ჯამში, ადამიანი დამსახურებულ აღიარებას ჰპოვებს;`,
    'ბ': `სამწუხაროდ, მთელი მისი მცდელობის მიუხედავად, ადამიანის ღვაწლი ხშირად აღია­რე­ბის გარეშე რჩება.`
  }
];

const answers = {
  2: 'ა',
  3: `ბ`,
  4: `ბ`,
  5: `ბ`,
  6: `ა`,
  7: `ა`,
  9: `ა`,
  10: `ბ`,
  11: `ბ`,
  12: `ბ`,
  13: `ბ`,
  15: `ბ`,
  16: `ა`,
  17: `ა`,
  18: `ა`,
  20: `ა`,
  21: `ა`,
  22: `ბ`,
  23: `ა`,
  25: `ა`,
  26: `ბ`,
  28: 'ბ',
  29: 'ა',
}

const userAnswers = Array(29);

function RenderQuestion({index,setAnswer}:any){

  let radio1 = createRef<HTMLInputElement>();
  let radio2 = createRef<HTMLInputElement>();

  useEffect(() => {
    if(radio1.current && radio2.current){
      radio1.current.checked = false;
      radio2.current.checked = false;
    }
  }, [index])

  return (
    <div style={{
      backgroundColor: '#120e25b9',
      flex: 1,
      display: 'grid',
      flexDirection: "column",
      marginLeft:30,
      marginRight:30,
      borderRadius:20,
      maxWidth:'1000px'
    }}>
      <p>{index}</p>
      <div style={{
        display: 'flex',
        flexDirection: 'row'
      }}>
        <input ref={radio1} style={styles.question} id={`1q${index + 1} `} name={`q${index + 1} `} type={'radio'}></input>
        <label htmlFor={`1q${index + 1} `}>
          <p style={styles.question}>{questions[index].ა}</p>
        </label>
      </div>

      <div style={{
        display: 'flex',
        flexDirection: 'row'
      }}>
        <input ref={radio2} style={styles.question} id={`2q${index + 1} `} name={`q${index + 1} `} type={'radio'}></input>
        <label htmlFor={`2q${index + 1} `}>
          <p style={styles.question}>{questions[index].ბ}</p>
        </label>
      </div>
      <button style={{
        margin:30,
        fontSize:32,
        padding:5,
        
        alignSelf:'flex-end'
        
      }} type='button'
        onClick={()=>{
          setAnswer('ა')
        }}
      >შემდეგი</button>
    </div>)
}

function RenderQuestions({ questions }: any) {

  const [question, setQuestion] = useState(0);

  const setAnswer = (answer:number) => {
    userAnswers[question] = answer;
    setQuestion(question+1)
  }

  return (
    <div style={{
      display: 'flex',
      flexBasis: '50%',
      flexDirection: 'column',
      alignContent:'center',
      alignItems:'center'
    }}>
      <RenderQuestion index={question} setAnswer={setAnswer}/>
    </div>
  )

  return (
    questions.map((question: { ა: string; ბ: string; number: number }, i: number) => {

    })
  )
}

const styles = {
  question: {
    color: 'white',
    padding: 5,
    margin: 10
  },
  questionContainer: {

  }
}

export default () => {

  const shuffledQuestions = ArrayShuffler(questions)

  return (
    <div style={{
      backgroundImage: "url(" + RoterImage + ")",
      backgroundPosition: 'center',
      backgroundSize: 'cover',
      backgroundRepeat: 'no-repeat',
      display: 'flex',
      flex: 1,
      flexDirection: 'column',
    }}>
      <p style={{
        textAlign: 'center',
        color: 'white',
        fontSize: 32,
        position: 'absolute',
        left: 0,
        right: 0,
        top: 10,
        margin: 'auto'
      }}>როტერის ტესტი</p>
      <div
        style={{
          display: 'flex',
          flexDirection: 'column',
          flex: 1,
          backgroundColor: '#000000d6',
        }}
      >
        <div
          style={{
            display: 'flex',
            flex: 5,
            flexDirection: 'column',
            justifyContent: 'center'
          }}
        >
          <RenderQuestions questions={shuffledQuestions} />
        </div>
      </div>
    </div>
  )
}




// `ა) არ არის სწორი აზრი, თითქოს პედაგოგები სტუდენტების მიმართ უსამართლო არიან; `
//   `ბ) სტუდენტების უმრავლესობა ვერ აცნობიერებს, თუ რაოდენ დიდ გავლენას ახდენს მათ შეფასებაზე შემთხვევითობა. `

//   `ა) ხელშემწყობი გარემოებათა გარეშე შეუძლებელია გახდე წარმატებული ხელმძღვანელი; `
//   `ბ) უნარიანი ადამიანი იმიტომ ვერ ხდება კარგი ხელმძღვანლი, რომ ვერ იყენებეს თავის შესაძლებლობებს; `

//   `ა) რაც არ უნდა ეცადო, ყველას მოსაწონი ვერ იქნები; `
//   `ბ) ადამიანები სხვების მოწონებას იმიტომ ვერ იმსახურებენ, რომ არ იციან, როგორ მოიქცნენ მათთან. `

//   `ა) პიროვნების ინდივიდუალობის ჩამოყალიბებაში ძირითად როლს მემკვიდრეობა თა­მა­შობს; `
//   `ბ) ინდივიდუალობას განაპირობებს ცხოვრებისეული გამოცდილება. `

//   `ა) ხშირად დავრწმუნებულვარ, რომ ის, რაც მოსახდენია, მოხდება; `
//   `ბ) ბედის იმედზე ყოფნა ხელს არ მოგვცემს, უმჯობესია თვითონ გადაწყვიტო, რა იღონო.`

//   `ა) მომზადებული სტუდენტისათვის არ არსებობს უსამართლო გამოცდა; `
//   `ბ) ხშირად სწავლა აზრს კარგავს იმიტომ, რომ გამოცდაზე ნიშნის მიღება მასწავლებლის ნება - სურვილზეა დამოკიდებული.`

//   `ა) წარმატება სერიოზული შრომით მიიღწევა, იღბალი და გამართლება არაფერ შუაშია; `
//   `ბ) წარმატების მიღწევა მხოლოდ მაშინ არის შესაძლებელი, თუ ვინმე გავლენიანი დამ­ხმა­რე გყავს. `

//   `ა) რიგით მოქალაქეს შეუძლია მოახდინოს გავლენა ხელისუფალთა გადაწყვეტილებებზე; `
//   `ბ) ამ სამყაროს მართავს ძალაუფლების მქონე ადამიანთა მცირე ჯგუფი, რიგითი ადამიანი ბევრს ვერაფერს გახდება. `

//   `ა) როცა რაიმეს ვგეგმავ, მის განხორციელებაში დარწმუნებული ვარ; `
//   `ბ) ზოგჯერ უაზრობაა რაიმეს დაგეგმვა, რადგანაც ბევრი რამ ბედზეა დამოკიდებული.`

//   `ა) ზოგიერთი ადამიანი არანაირ ღირებულებას არ წარმოადგენს; `
//   `ბ) ყველა ადამიანში არის რაღაც კარგი. `

//   `ა) ჩემთვის იმის მიღწევას, რაც მსურს, არაფერი აქვს საერთო იღბალთან; `
//   `ბ) ზოგჯერ არანაირი აზრი არ აქვს იმას, თუ რა გადაწყვეტილებას მივიღებთ, რას მოვიმოქმედებთ.`

//   `ა) სამსახურეობრივი წინსვლა ხშირად დამოკიდებულია შემთხვევითობაზე და სხვების ნება - სურვილზე; `
//   `ბ) სამსახურეობრივი კარიერა ადამიანის მონდომებასა და უნარებზეა დამოკიდებული, იღბალი აქ არაფერ შუაშია.`

//   `ა) ადამიანთა უმრავლესობა მსოფლიო მოვლენების მსხვერპლია, რომელთა გაგება და კონტროლი მათ არ ძალუძთ; `
//   `ბ) პოლიტიკურ და სოციალურ პროცესებში აქტიური მონაწილეობით ადამიანებს შეუძლიათ მსოფლიო მოვლენათა კონტროლი.`

//   `ა) ადამიანთა უმრავლესობა ვერ აცნობიერებს, თუ რამდენად განსაზღვრავს მათ ცხოვ­რე­ბას შემთხვევითობა; `
//   `ბ) ფაქტიურად “იღბალი”, როგორც ასეთი, არ არსებობს.`

//   `ა) ყოველთვის უნდა იყო მზად აღიარო საკუთარი შეცდომები; `
//   `ბ) ჩვეულებრივ, უმჯობესია დაფარო საკუთარი შეცდომები.`

//   `ა) ძნელია იმის გაგება, ნამდვილად მოსწონხარ თუ არა ადამიანს; `
//   `ბ) მეგობრების რაოდენობა დამოკიდებულია იმაზე, თუ რამდენად სასიამოვნო პიროვნება ხარ. `

//   `ა) დრო ყველაფრის მკურნალია – ჩვეულებრივ, წარუმატებლობას წარმატება სცვლის; `
//   `ბ) წარუმატებლობა, ფაქტობრივად, უუნარობის, უცოდინარობის, სიზარმაცის(ან სამივეს ერთად) შედეგია. `

//   `ა) თუ მოვინდომებთ, პროტექციონიზმის აღმოფხვრას შევძლებთ; `
//   `ბ) რიგითი ადამიანი ვერაფერს შეცვლის ხელმძღვანელი მუშაკის სამოქმედო პოლიტიკაში.`

//   `ა) ზოგჯერ ვერ გაიგებ, რა პრინციპით წერენ მასწავლებლები ნიშნებს; `
//   `ბ) ნიშნებს ცოდნა განსაზღვრავს.`

//   `ა) კარგი ხელმძღვანელი კოლექტივს ინიციატივის გამოჩენის შესაძლებლობას აძლევს; `
//   `ბ) კარგი ხელმძღვანელი თვითონ წარმართავს კოლექტივის ინიციატივას.`

//   `ა) ხშირად მეჩვენება, რომ ნაკლებად ვახდენ ზეგავლენას იმაზე, რაც მემართება; `
//   `ბ) ვერ დავიჯერებ, რომ შემთხვევა ან იღბალი განსაზღვრავს ჩემს ცხოვრებას.`

//   `ა) ადამიანები მარტო რჩებიან, რადგან არ ცდილობენ იყვნენ მეგობრული; `
//   `ბ) ნუ გაირჯები თავი მოაწონო ადამიანებს, მაინც არაფერი გამოგივა. `

//   `ა) უმაღლეს სასწავლებლებში ზედმეტ ყურადღებას აქცევენ სპორტს; `
//   `ბ) “გუნდური სპორტი” ხასიათის ჩამოყალიბების საუკეთესო საშუალებაა.`

//   `ა) რაც მემართება, ჩემით მემართება; `
//   `ბ) ზოგჯერ ვგრძნობ, რომ ჩემს ცხოვრებას ვერ წარვმართავ.`

//   `ა) ხშირად ძნელია გაიგო, თუ რატომ იქცევიან ხელმძღვანლები ასე და არა სხვაგვარად; `
//   `ბ) საბოლოო ჯამში ადამიანები პასუხს აგებენ ყველა რანგის ხელმძღვანელთა ავკარგიანობაზე.` 
